import * as React from 'react';

interface IAboutProps {
}

const About: React.FunctionComponent<IAboutProps> = (props) => {
    return <>
        <div className='about-page-container'>
            <p className={'about-title'}>Мы рады приветствовать Вас на электронном портале «Фольклор народов Сибири»!</p>
            <p>Электронный портал «Фольклор народов Сибири» разрабатывается для публикации и систематизации фольклорных произведений, записанных у коренных народов Сибири. Портал обеспечивает доступ к редким фольклорным текстам, а также удобную навигацию по типическим местам, из которых они состоят. Навигация по текстам осуществляется по дереву понятий онтологии (раздел «Онтология»). Кроме специфических текстовых объектов онтология дает представление о предметной области «Фольклористика», ее предмете, объекте, организациях и персонах, занятых в научных фольклористических исследованиях.</p>
            <p>Страница текста, открывающаяся при выборе текста, представляет собой параллельный корпус на национальном (слева) и русском (справа) языках. При нажатии на размеченные фрагменты текста (помечены зеленым треугольником) появляется дополнительное меню внизу страницы, где содержатся все мультимедийные материалы, синхронизированные с данным отрывком текста. Фрагменты, имеющие семантическую аннотацию, выделены цветом. Значение фольклорной аннотации, сформированной на основе онтологии, отображается в окне справа.</p>
            <p>Электронный портал «Фольклор народов Сибири» разрабатывается с 2014 года сотрудниками Института филологии СО РАН и Института систем информатики имени А.П. Ершова СО РАН при финансовой поддержке РГНФ (проект №14-04-12010 Электронный ресурс «Фольклор народов Сибири»: текстовое, семантическое и мультимедийное представление»).</p>
            <p>С 2019 года идет пополнение портала новыми фольклорными материалами, формирование новых подкорпусов, а также новых веток онтологии. Работы ведутся в рамках выполнения проекта Института филологии СО РАН «Культурные универсалии вербальных традиций народов Сибири и Дальнего Востока: фольклор, литература, язык» по гранту Правительства РФ для государственной поддержки научных исследований, проводимых под руководством ведущих ученых (соглашение № 075-15-2019-1884).</p>
        </div>
    </>;
};

export default About;
