import * as React from 'react';
import { NEWS_1 } from '../utils';
import { Link } from 'react-router-dom'
interface INewsItemProps {
}

const NewsItem: React.FunctionComponent<INewsItemProps> = (props) => {
    return <>
        <div className='sub-page-container'>
            <Link to='/news' className='workspace-return'><i className='fas fa-long-arrow-alt-left'></i>К списку новостей</Link>
            <div className='news-item-page-container'>
                <p className='news-item-page-date'>28.07.2021</p>
                <p className='news-item-page-title'>Кто такие теленгиты и зачем им топшур? Исчезающие народы России</p>
                <p className='news-item-page-paragraph'>На земле осталось всего около четырех тысяч теленгитов — древнего тюркского народа. Долгое время теленгиты считались субэтнической группой алтайцев и лишь во время переписи населения в 2000 году были зафиксированы как отдельная народность.</p>
                <img src={NEWS_1}></img>
                <p className='news-item-page-paragraph'>Теленгиты живут обособленно, в одном из самых засушливых мест планеты — в Чуйской степи Горного Алтая. Они уверены, что Чуйская степь — это место невиданной силы и сакральных знаний. Посредником между мирами выступает шаман. Он приносит жертвоприношения духам и божествам. Особенно почитаются горные перевалы: преодолевая их, теленгиты жертвуют духу — хозяину горы камни или ветви.</p>
                <p className='news-item-page-paragraph'>Несмотря на суровый климат и кочевой образ жизни, местные жители кормят свои семьи, занимаясь скотоводством и благодаря за удачные годы матушку землю и духов гор. Теленгиты разводят яков, верблюдов, лошадей, коров, овец и коз и пасут домашних животных круглый год: зимой — на высокогорных плато, весной и осенью — на предгорных пастбищах, а летом — в долинах рек. Они живут в переносных шалашах-чумах или войлочных юртах, которые перевозят вместе со всем хозяйством на новые места постоя. Помимо скотоводства и земледелия, мужчины занимаются охотой, а женщины собирательством — дикорастущих трав, кореньев и ягод.</p>
                <p className='news-item-page-quote'>«Раньше все было как: мать земля людей кормила, а небо поило. Сейчас же многим кажется, что все можно купить в магазине. Сел в машину и поехал. И для этого необязательно молиться, строить святилища или поклоняться родовым местам. Но что, если человек живет не в городе, а мечтает о чем-то ином — о хороших пастбищах и о погоде, которая должна соблаговолить вовремя перекочевать»</p>
                <p className='news-item-page-paragraph'>Музыка присутствует в жизни теленгитов с момента рождения и всю последующую жизнь. Колыбельные песни поют как женщины, так и мужчины — отцы и дедушки владеют искусством горлового пения. Также с помощью мелодичных напевов теленгиты располагают животных к кормлению новорожденных детенышей, успокаивают их во время надоя. Разнообразие таких вокальных скотоводческих заговоров велико, ведь от благополучия поголовья скота напрямую зависит жизнь теленгитов.</p>
            </div>
        </div>
    </>;
};

export default NewsItem;
